In [16]:
#import packages
import pandas as pd
import csv
import os
import numpy as np
from sqlalchemy import create_engine

In [2]:
#import tsv file into df 
kids_df = pd.read_csv('kids_teen.tsv',delimiter='\t',encoding='utf-8')

kids_df.describe()
kids_df.head()

,round,value,daily_double,category,comments,answer,question,air_date,notes
0,1,100,no,BIRDS,-,The bat parrot probably got its name from slee...,upside-down,1987-02-16,1987 Teen Tournament quarterfinal game 1.
1,1,200,no,BIRDS,-,"Too ""lei""zy to migrate, the geese in this trop...",Hawaii,1987-02-16,1987 Teen Tournament quarterfinal game 1.
2,1,300,no,BIRDS,-,A bird waterproofs its feathers with oil from ...,its tail,1987-02-16,1987 Teen Tournament quarterfinal game 1.
3,1,100,no,THE LIBRARY,-,Defacing books or shouting or throwing spitbal...,three activities prohibited in the library,1987-02-16,1987 Teen Tournament quarterfinal game 1.
4,1,200,no,THE LIBRARY,-,"On most reference books in your local library,...",R,1987-02-16,1987 Teen Tournament quarterfinal game 1.

In [3]:
#import second tsv file into df 
master_df = pd.read_csv('master_season1-35.tsv',delimiter='\t',encoding='utf-8')

master_df.describe()
master_df.head()

,round,value,daily_double,category,comments,answer,question,air_date,notes
0,1,100,no,LAKES & RIVERS,-,River mentioned most often in the Bible,the Jordan,1984-09-10,-
1,1,200,no,LAKES & RIVERS,-,Scottish word for lake,loch,1984-09-10,-
2,1,400,no,LAKES & RIVERS,-,American river only 33 miles shorter than the ...,the Missouri,1984-09-10,-
3,1,500,no,LAKES & RIVERS,-,"World's largest lake, nearly 5 times as big as...",the Caspian Sea,1984-09-10,-
4,1,100,no,INVENTIONS,-,Marconi's wonderful wireless,the radio,1984-09-10,-

In [4]:
#exploratory#
print(master_df['category'].value_counts())
print(master_df['air_date'].value_counts())

SCIENCE                    860
LITERATURE                 814
AMERICAN HISTORY           788
HISTORY                    720
SPORTS                     701
                          ...
CLASSIC MOVIE SCENES         1
FOREIGN AFFAIRS              1
1960s SCIENCE BOOKS          1
NEWS FROM THE EQUATO         1
U.S. GOVERNMENT HISTORY      1
Name: category, Length: 43369, dtype: int64
2004-01-06    61
1999-10-26    61
1997-02-03    61
1992-05-15    61
1998-12-17    61
              ..
1986-02-25    15
1990-06-12    14
1993-01-29     8
1990-05-25     1
1989-06-30     1
Name: air_date, Length: 6297, dtype: int64

In [5]:
#exploratory#
print(kids_df['category'].value_counts())
print(kids_df['air_date'].value_counts())

STATE CAPITALS              97
AMERICAN HISTORY            78
AMERICAN LITERATURE         73
BODIES OF WATER             72
WORLD CAPITALS              71
                            ..
NOTABLE AMERICAN WOMEN       1
HOLIDAY QUOTES               1
U.S. GOVERNMENT AGENCIES     1
WORD PLAY                    1
20th CENTURY NOVELS          1
Name: category, Length: 3303, dtype: int64
2003-02-05    61
1997-02-13    61
2003-02-03    61
1999-11-08    61
1997-02-11    61
              ..
2001-12-24    45
2014-12-02    45
2001-09-27    44
2005-10-12    42
2004-10-22    41
Name: air_date, Length: 370, dtype: int64

In [6]:
#Add binary column for kids_jeopardy delegation#
kids_df['kids_jeopardy'] = 0
master_df['kids_jeopardy'] = 1

In [7]:
# append two data sets into one file #
jeopardy_df = kids_df.append(master_df) 
jeopardy_df.head()

,round,value,daily_double,category,comments,answer,question,air_date,notes,kids_jeopardy
0,1,100,no,BIRDS,-,The bat parrot probably got its name from slee...,upside-down,1987-02-16,1987 Teen Tournament quarterfinal game 1.,0
1,1,200,no,BIRDS,-,"Too ""lei""zy to migrate, the geese in this trop...",Hawaii,1987-02-16,1987 Teen Tournament quarterfinal game 1.,0
2,1,300,no,BIRDS,-,A bird waterproofs its feathers with oil from ...,its tail,1987-02-16,1987 Teen Tournament quarterfinal game 1.,0
3,1,100,no,THE LIBRARY,-,Defacing books or shouting or throwing spitbal...,three activities prohibited in the library,1987-02-16,1987 Teen Tournament quarterfinal game 1.,0
4,1,200,no,THE LIBRARY,-,"On most reference books in your local library,...",R,1987-02-16,1987 Teen Tournament quarterfinal game 1.,0

In [21]:
#drop irrelevant columns in dataframe#
jeopardy_df = jeopardy_df[['round', 'value', 'category', 'answer', 'question', 'air_date', 'kids_jeopardy']].copy()

#rename value column to point_value
jeopardy_df['point_value']= jeopardy_df['value']
jeopardy_df.head()

,round,value,category,answer,question,air_date,kids_jeopardy,point_value
0,1,100,BIRDS,The bat parrot probably got its name from slee...,upside-down,1987-02-16,0,100
1,1,200,BIRDS,"Too ""lei""zy to migrate, the geese in this trop...",Hawaii,1987-02-16,0,200
2,1,300,BIRDS,A bird waterproofs its feathers with oil from ...,its tail,1987-02-16,0,300
3,1,100,THE LIBRARY,Defacing books or shouting or throwing spitbal...,three activities prohibited in the library,1987-02-16,0,100
4,1,200,THE LIBRARY,"On most reference books in your local library,...",R,1987-02-16,0,200

In [19]:
#connect to PostgreSQL#
rds_connection_string = "postgres:postgres@localhost:5432/customer_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [ ]:
#################AFTER TABLE CREATION IN POSTGRES###############################

#check table names# 
engine.table_names()

In [ ]:
#add data to PostgreSQL
jeopardy_df.to_sql(name='jeopardy_table', con=engine, if_exists='append', index=False)

In [ ]:
#Check data with a query
pd.read_sql_query('select * from jeopardy_table', con=engine).head()